Repository: osaurus-ai/osaurus
Catalog: Packages/OsaurusCore/Resources/Localizable.xcstrings
Source language: en
Languages: ko, ru, zh_hans, zh_hant

source: No matching models.
ru: Нет подходящих моделей.
zh_hans: 没有匹配的模型。
zh_hant: 沒有匹配的模型。

source: No other agents yet — create another agent to make it spawnable.
ru: Других агентов пока нет. Создайте ещё одного агента, чтобы его можно было запускать как субагента.
zh_hans: 暂无其他智能体 — 创建另一个智能体以使其可被生成。
zh_hant: 暫無其他智能體 — 創建另一個智能體以使其可被生成。

source: No settings match "%@"
ru: Нет настроек, соответствующих "%@"
zh_hans: 没有设置匹配“%@”
zh_hant: 沒有設置匹配「%@」

source: None yet. Add a local or remote model to delegate to it directly, with no agent attached.
ru: Пока нет. Добавьте локальную или удалённую модель, чтобы напрямую делегировать ей полномочия без подключения агента.
zh_hans: 暂无内容。添加本地或远程模型以直接委派任务，无需关联智能体。
zh_hant: 暫無內容。添加本地或遠程模型以直接委派任務，無需關聯智能體。

source: None yet. Add an agent to delegate a task to it (using its own prompt + model).
ru: Пока нет. Добавьте агента, чтобы делегировать ему задачу (с использованием собственной промпты + модели).
zh_hans: 暂无内容。添加智能体以委派任务（将使用其自带的提示词与模型）。
zh_hant: 暫無內容。添加智能體以委派任務（將使用其自帶的提示詞與模型）。

source: Not an MLX model
ru: Не модель MLX
zh_hans: 不是 MLX 模型
zh_hant: 不是MLX模型

source: Not an MLX model — the local engine can't load this bundle
ru: Не модель MLX — локальный движок не может загрузить этот пакет.
zh_hans: 不是 MLX 模型 — 本地引擎无法加载此包
zh_hant: 不是 MLX 模型 — 本地引擎無法加載此包

source: Not downloaded yet
ru: Ещё не загружено
zh_hans: 尚未下载
zh_hant: 尚未下載

source: Not MLX
ru: Не MLX
zh_hans: 不是 MLX
zh_hant: 不是MLX

source: NOT NULL
ru: не NULL

source: Not ready
ru: Не готов
zh_hans: 未就绪
zh_hant: 未就緒

source: OAuth
ru: OAавт

source: Ollama
ru: Оллама

source: On-device image model
ru: Модель изображения на устройстве
zh_hans: 设备端图片模型
zh_hant: 設備端圖片模型

source: Open the Images pane in Settings
ru: Откройте панель изображений в настройках
zh_hans: 打开设置中的图片面板
zh_hant: 打開設置中的圖片面板

source: OpenAI
ru: ОткрытьИИ

source: Optional numeric seed
ru: Необязательное числовое начальное значение
zh_hans: 可选数字种子
zh_hant: 可選數字種子

source: Osaurus Cloud
ru: Osaurus Облако
zh_hans: Osaurus 云
zh_hant: Osaurus雲

source: Output image size
ru: Размер выходного изображения
zh_hans: 输出图片大小
zh_hant: 輸出圖片大小

source: Owner
ru: Владелец
zh_hans: 所有者
zh_hant: 所有者

source: Paste an MLX language model (try `OsaurusAI` or `mlx-community`) or an mflux image model — each is routed to the right place automatically.
ru: Вставьте языковую модель MLX (попробуйте `OsaurusAI` или `mlx-community`) или модель изображения mflux — каждая из них автоматически направляется в нужное место.
zh_hans: 粘贴 MLX 语言模型（尝试 `OsaurusAI` 或 `mlx-community`）或 mflux 图片模型——每个都会自动路由到正确的位置。
zh_hant: 粘貼 MLX 語言模型（嘗試 `OsaurusAI` 或 `mlx-community`）或 mflux 圖片模型——每個都會自動路由到正確的位置。

source: PATH
ru: ПУТЬ
zh_hans: 路径

source: Prefill
ru: Предварительное заполнение
zh_hans: 预填充
zh_hant: 預填充

source: Preview screen context
ru: Контекст экрана предварительного просмотра
zh_hans: 预览屏幕上下文
zh_hant: 預覽屏幕上下文

source: RAM
ru: ОЗУ
zh_hans: 内存
zh_hant: 內存

source: RAM-Safety Preflight
ru: Предварительная проверка памяти
zh_hans: 内存安全预检
zh_hant: 內存安全預檢

source: random
ru: случайный
zh_hans: 随机
zh_hant: 隨機

source: Re-download
ru: Перезагрузить
zh_hans: 重新下载
zh_hant: 重新下載

source: Re-download to fetch any missing files.
ru: Загрузите повторно, чтобы получить недостающие файлы.
zh_hans: 重新下载以获取缺失的文件。
zh_hant: 重新下載以獲取缺失的文件。

source: Remove Model
ru: Удалить модель
zh_hans: 移除模型
zh_hant: 刪除模型

source: Remove model?
ru: Удалить модель?
zh_hans: 移除模型？
zh_hant: 刪除模型？

source: Replace…
ru: Заменять…
zh_hans: 替换…
zh_hant: 替換…

source: Repo
ru: Репо
zh_hans: 代码仓库
zh_hant: 代碼倉庫

source: Request evidence
ru: Запросить доказательства
zh_hans: 请求证据
zh_hant: 請求證據

# Request failed: %@. Redacted request evidence: %@
source: Request failed: %1$@. Redacted request evidence: %2$@
ru: Запрос не выполнен: %1$@. Отредактированные доказательства запроса: %2$@
zh_hans: 请求失败：%1$@。已编辑的请求证据：%2$@
zh_hant: 請求失敗：%1$@。已編輯的請求證據：%2$@

source: Restore Chat Defaults
ru: Восстановить настройки чата по умолчанию
zh_hans: 恢复聊天默认设置
zh_hant: 恢復聊天默認設置

source: Restore chat settings to recommended defaults (saved automatically, like any change)
ru: Восстановить настройки чата до рекомендуемых значений по умолчанию (сохраняется автоматически, как и любые изменения).
zh_hans: 将聊天设置恢复为推荐默认值（自动保存，如同任何更改）
zh_hant: 將聊天設置恢復爲推薦默認值（自動保存，如同任何更改）

source: Review manifest and install
ru: Просмотрите манифест и установите
zh_hans: 查看清单并安装
zh_hant: 查看清單並安裝

source: Router balance
ru: Баланс Router
zh_hans: 路由器余额
zh_hant: 路由器餘額

source: Run AppleScript
ru: Запустить AppleScript
zh_hans: 运行 AppleScript
zh_hant: 運行 AppleScript

source: Running AppleScript that controls another app needs macOS Automation permission. The first time an agent controls an app, macOS asks you to allow it for Osaurus. You can prime the System Events grant now.
ru: Для AppleScript, который управляет другим приложением, требуется разрешение macOS «Автоматизация». Когда агент впервые управляет приложением, macOS попросит разрешить это для Osaurus. Сейчас можно заранее выдать доступ к System Events.
zh_hans: 运行控制其他应用的 AppleScript 需要 macOS 自动化权限。当智能体首次控制某个应用时，macOS 会要求你允许 Osaurus 对其进行控制。你可以现在预先授予 System Events 权限。
zh_hant: 運行控制其他應用的 AppleScript 需要 macOS 自動化權限。當智能體首次控制某個應用時，macOS 會要求你允許 Osaurus 對其進行控制。你可以現在預先授予系統事件權限。

source: Save As…
ru: Сохранить как…
zh_hans: 另存为…
zh_hant: 另存爲…

source: Script execution
ru: Запуск сценариев
zh_hans: 脚本执行
zh_hant: 腳本執行

source: Search agents
ru: Поисковые агенты
zh_hans: 搜索智能体
zh_hant: 搜索智能體

source: Seed
ru: Семя
zh_hans: 种子
zh_hant: 種子

source: seed %@
ru: семя %@
zh_hans: 种子 %@
zh_hant: 種子 %@

source: Selected image model does not accept source images.
ru: Выбранная модель изображения не принимает исходные изображения.
zh_hans: 所选图片模型不接受源图片。
zh_hant: 所選圖片模型不接受源圖片。

source: Send iMessages from your Mac.
ru: Отправляет сообщения iMessage с вашего Mac.
zh_hans: 从 Mac 发送 iMessage。
zh_hant: 從 Mac 傳送 iMessage。

source: Sharpest. The size most models are trained for, but slowest.
ru: Самый острый. Размер, на который рассчитано большинство моделей, но самый медленный.
zh_hans: 最清晰。这是大多数模型训练时采用的尺寸，但速度最慢。
zh_hant: 最清晰。大多數模型訓練的尺寸，但最慢。

source: Shell
ru: Терминал

source: Show %lld more
ru: Показать %lld ещё
zh_hans: 再显示 %lld 项
zh_hant: 顯示%lld更多

source: Show fewer
ru: Показать меньше
zh_hans: 收起
zh_hant: 顯示更少

source: Single Residency
ru: Единая резиденция
zh_hans: 单模型驻留
zh_hant: 單駐留

source: sk-…
ru: ск-…

source: Spawn
ru: Делегирование
zh_hans: 生成
zh_hant: 生成

source: Spawn & Delegation
ru: Субагенты и делегирование
zh_hans: 生成与委托
zh_hant: 生成與委託

source: Stdio
ru: студия

source: Stdio %@
ru: Стдио %@

source: Strength
ru: Сила
zh_hans: 强度
zh_hant: 強度

source: Strict Single Job
ru: Строгая одиночная работа
zh_hans: 严格单任务
zh_hant: 嚴格單任務

source: Subagents
ru: Субагенты
zh_hans: 子智能体
zh_hant: 子智能體

source: swift
ru: быстрый

source: Terms to avoid during image generation
ru: Термины, которых следует избегать при создании изображений
zh_hans: 图片生成时应避免的词语
zh_hant: 圖片生成時應避免的術語

source: Test Notification
ru: Тестовое уведомление
zh_hans: 测试通知
zh_hant: 測試通知

source: The models image jobs fall back to. Each agent can override these in its own Subagents settings.
ru: Имиджевые работы моделей возвращаются к ним. Каждый агент может переопределить их в настройках своих субагентов.
zh_hans: 用于图像任务回退的模型。每个智能体可在其自己的子智能体设置中覆盖这些设置。
zh_hant: 用於圖像任務回退的模型。每個智能體可在其自己的子智能體設置中覆蓋這些設置。

source: This agent advertised that it supports encryption but didn't include a verifiable identity, so it can't be paired securely. It may be impersonating another device, or the other device may need to update Osaurus.
ru: Этот агент заявил поддержку шифрования, но не передал проверяемую идентификацию, поэтому безопасно связать его нельзя. Возможно, он выдаёт себя за другое устройство, или на другом устройстве нужно обновить Osaurus.
zh_hans: 此智能体声称支持加密，但未包含可验证的身份，因此无法安全配对。它可能在冒充其他设备，或者对方设备可能需要更新 Osaurus。
zh_hant: 此代理聲稱支持加密但未包含可驗證的身份，因此無法安全配對。它可能在冒充其他設備，或者對方設備可能需要更新 Osaurus。

source: This bundle isn't in MLX format, so the local engine (vmlx) can't load it. Osaurus runs MLX-format weights only — convert it with mlx_lm or pick an MLX build of the model.
ru: Этот пакет не в формате MLX, поэтому локальный движок (vmlx) не может его загрузить. Osaurus работает только с весами в формате MLX — преобразуйте его с помощью mlx_lm или выберите сборку модели MLX.
zh_hans: 这个捆绑包不是 MLX 格式，因此本地引擎(vmlx)无法加载它。Osaurus 只能运行 MLX 格式的权重——请使用 mlx_lm 进行转换，或选择该模型的 MLX 版本。
zh_hant: 這個捆綁包不是MLX格式，因此本地引擎(vmlx)無法加載它。Osaurus只能運行MLX格式的權重——請使用mlx_lm進行轉換，或選擇該模型的MLX版本。

source: This bundle isn't ready
ru: Этот пакет не готов
zh_hans: 此包尚未就绪
zh_hant: 此包尚未就緒

source: This deletes the on-disk model. Detection for it stops until you re-download.
ru: При этом модель на диске будет удалена. Обнаружение его прекращается до повторной загрузки.
zh_hans: 此操作将删除本地磁盘上的模型。该模型的检测功能将停止，直至你重新下载。
zh_hant: 此操作將刪除本地磁盤上的模型。該模型的檢測功能將停止，直至您重新下載。

source: This Session
ru: Эта сессия
zh_hans: 当前会话
zh_hant: 當前會話

source: Tiny and fast. Catches names, addresses, and IDs/secrets. No date detection.
ru: Компактная и быстрая модель. Находит имена, адреса, идентификаторы и секреты. Даты не распознаёт.
zh_hans: 轻量且快速。 可检测姓名、地址以及 ID / 敏感信息。不支持日期检测。
zh_hant: 輕量且快速。 可檢測姓名、地址以及 ID / 敏感信息。不支持日期檢測。

source: Toast notifications are working!
ru: Всплывающие уведомления работают!
zh_hans: Toast 通知正常工作！
zh_hant: 通知消息已生效！

source: Top Center
ru: Сверху по центру
zh_hans: 顶部居中
zh_hant: 頂部居中

source: Top Left
ru: Сверху слева
zh_hans: 左上
zh_hant: 左上

source: Top Right
ru: Сверху справа
zh_hans: 右上
zh_hant: 右上

source: Top-P (Nucleus)
ru: Топ-П (Ядро)
zh_hans: Top-P（核采样）
zh_hant: Top-P（核採樣）

source: Transaction ledger
ru: Журнал транзакций
zh_hans: 交易账簿
zh_hant: 交易賬簿

source: Trust preview
ru: Предварительный просмотр доверия
zh_hans: 信任预览
zh_hant: 信任預覽

source: Try a different term, like “hotkey” or “privacy”.
ru: Попробуйте другой термин, например «горячая клавиша» или «конфиденциальность».
zh_hans: 尝试其他术语，如“快捷键”或“隐私”。
zh_hant: 嘗試其他術語，如「快捷鍵」或「隱私」。

source: Try a different term, like “hotkey” or “transcription”.
ru: Попробуйте другой термин, например «горячая клавиша» или «транскрипция».
zh_hans: 尝试其他术语，如“快捷键”或“转写”。
zh_hant: 嘗試其他術語，如「快捷鍵」或「轉錄」。

source: TTFT %.0fms
ru: TTFT %.0fмс
zh_hans: 首 Token 延迟 %.0f 毫秒
zh_hant: 首詞元延遲 %.0f 毫秒

source: TTFT %.2fs
ru: TTFT %.2fс
zh_hans: 首 Token 延迟 %.2f 秒
zh_hant: 首詞元延遲 %.2f 秒

source: Unload After Agent Job
ru: Выгрузить после задания агента
zh_hans: 智能体工作后卸载
zh_hant: 智能體工作後卸載

source: Unload After Job
ru: Разгрузка после работы
zh_hans: 工作后卸载
zh_hant: 工作後卸載

source: Upscale
ru: Увеличить разрешение
zh_hans: 超清化
zh_hant: 超清化

source: Use an on-device model to catch names, addresses, and secrets that pattern rules miss. Pick and install a model below.
ru: Используйте модель на устройстве, чтобы улавливать имена, адреса и секреты, которые пропускают правила шаблонов. Выберите и установите модель ниже.
zh_hans: 使用端侧模型来捕获模式规则无法识别的姓名、地址及敏感信息。请在下方选择并安装模型。
zh_hant: 使用端側模型來捕獲模式規則無法識別的姓名、地址及敏感信息。請在下方選擇並安裝模型。

source: Use the agent's model
ru: Используйте модель агента
zh_hans: 使用智能体的模型
zh_hant: 使用智能體的模型

source: Verifying…
ru: Проверка…
zh_hans: 正在验证…
zh_hant: 正在驗證…

source: WAV, MP3, M4A
ru: WAV, MP3, М4А

source: When the main chat model is itself local, unload it to run the helper, then reload it afterward. On by default so a local agent can run a local helper; turn off to keep local-to-local handoff disabled and avoid double residency. (Cloud orchestrators never need this.)
ru: Если основная модель чата локальная, Osaurus выгружает её, запускает вспомогательную задачу, затем загружает обратно. Включено по умолчанию, чтобы локальный агент мог запускать локального помощника; отключите, чтобы запретить локальную передачу и избежать одновременной загрузки двух моделей. Облачным оркестраторам это не требуется.
zh_hans: 当主聊天模型本身是本地模型时，卸载它以运行辅助模型，然后重新加载。默认开启，以便本地智能体可以运行本地辅助模型；关闭以保持本地到本地交接禁用并避免双重驻留。（云端协调器不需要此功能。）
zh_hant: 當主聊天模型本身是本地模型時，卸載它以運行輔助模型，然後重新加載。默認開啓，以便本地智能體可以運行本地輔助模型；關閉以保持本地到本地交接禁用並避免雙重駐留。（雲端協調器不需要此功能。）

source: When/how to use this model (optional)
ru: Когда/как использовать эту модель (необязательно)
zh_hans: 何时/如何使用此模型（可选）
zh_hant: 何時/如何使用此模型（可選）

source: Where toast notifications appear on screen
ru: Где на экране появляются всплывающие уведомления
zh_hans: 通知消息在屏幕上的显示位置
zh_hant: 通知消息在屏幕上的顯示位置

source: Which AppleScript model the agent uses.
ru: Какую модель AppleScript использует агент.
zh_hans: 智能体使用的 AppleScript 模型。
zh_hant: 智能體使用的 AppleScript 模型。

source: -1001234567890 — one per line
zh_hans: -1001234567890 — 每行一个
zh_hant: -1001234567890 — 每行一個

source: -1001234567890 or @channelname — one per line
zh_hans: -1001234567890 或 @channelname — 每行一个
zh_hant: -1001234567890 或 @channelname — 每行一個

source: …and %lld more
zh_hans: …以及另外 %lld 个
zh_hant: …以及另外 %lld 個

source: %@ · 1 line
zh_hans: %@ · 1 行
zh_hant: %@ · 1 行

source: %@ (auto)
zh_hans: %@（自动）
zh_hant: %@（自動）

# %@ %@ · usable budget %lld%%
source: %1$@ %2$@ · usable budget %3$lld%%
zh_hans: %1$@ %2$@ · 可用预算 %3$lld%%
zh_hant: %1$@ %2$@ · 可用預算 %3$lld%%

# %@ auto-disabled for %@ — its context window is too small to carry them.
source: %1$@ auto-disabled for %2$@ — its context window is too small to carry them.
zh_hans: %1$@ 已为 %2$@ 自动禁用 — 其上下文窗口太小无法承载。
zh_hant: %1$@ 已爲 %2$@ 自動停用 — 其上下文窗口太小無法承載。

# %@ remaining of %@
source: %1$@ remaining of %2$@
zh_hans: %1$@ / %2$@ 剩余
zh_hant: %1$@ / %2$@ 剩餘

# %@ remaining of %@ usable
source: %1$@ remaining of %2$@ usable
zh_hans: 剩余 %1$@（可用 %2$@）
zh_hant: 剩餘 %1$@（可用 %2$@）

source: %@ was changed outside this chat and was left untouched.
zh_hans: %@ 在此聊天之外已被更改，保持未修改状态。
zh_hant: %@ 在此聊天之外已被更改，保持未修改狀態。

# %@, %lld session(s)
source: %1$@, %2$lld session(s)
zh_hans: %@，%lld 个会话
zh_hant: %@，%lld 個會話

source: %lld active
zh_hans: %lld 个活跃
zh_hant: %lld 個活躍

# %lld allowed · %lld people
source: %1$lld allowed · %2$lld people
zh_hans: 允许 %1$lld 个 · %2$lld 人
zh_hant: 允許 %1$lld 個 · %2$lld 人

source: %lld artifacts
zh_hans: %lld 个工件
zh_hant: %lld 個工件

source: %lld blocking findings must be fixed before provisioning.
zh_hans: 必须先修复 %lld 个阻塞发现才能进行配置。
zh_hant: 必須先修復 %lld 個阻塞發現才能進行設定。

source: %lld channels
zh_hans: %lld 个频道
zh_hant: %lld 個頻道

source: %lld docs uncategorized
zh_hans: %lld 个文档未分类
zh_hant: %lld 個文件未分類

source: %lld documents have no category
zh_hans: %lld 个文档没有类别
zh_hant: %lld 個文件沒有類別

source: %lld documents have no category. This is optional, agents can still search and read them. To let agents filter by category, add a `type:` line (e.g. `type: policy`) to the top of each file. Click for the list.
zh_hans: 共 %lld 篇文档未设置分类。此项为可选配置，智能体仍可搜索和读取这些文档。若要让智能体按分类筛选，请在每个文件的顶部添加 `type:` 字段（例如 `type: policy`）。点击查看文档列表。
zh_hant: 共 %lld 份文件未設定分類。此為可選設定，代理仍可搜尋和閱讀這些檔案。若要讓代理按分類篩選，請在每個檔案頂部添加 `type:` 欄位（例如 `type: policy`）。點擊查看檔案列表。

source: %lld earlier steps
zh_hans: 之前的 %lld 个步骤
zh_hant: %lld 之前的步驟

source: %lld external candidates skipped
zh_hans: 跳过 %lld 个外部候选
zh_hant: 跳過 %lld 個外部候選

source: %lld failed.
zh_hans: %lld 个失败。
zh_hant: %lld 個失敗。

source: %lld found
zh_hans: 找到 %lld 个
zh_hant: 找到 %lld 個

source: %lld items would be redacted
zh_hans: %lld 个项目将被隐去
zh_hant: %lld 個項目將被編輯

source: %lld manual-model providers
zh_hans: %lld 个手动模型提供商
zh_hant: %lld 個手動模型提供者

source: %lld models currently available.
zh_hans: 当前可用 %lld 个模型。
zh_hant: 當前可用 %lld 個模型。

source: %lld models found
zh_hans: 找到 %lld 个模型
zh_hant: 找到 %lld 個模型

source: %lld more matches — keep typing to narrow the list.
zh_hans: 还有 %lld 个匹配 — 继续输入以缩小列表。
zh_hant: 還有 %lld 個匹配 — 繼續輸入以縮小列表。

source: %lld more not shown — search to find them.
zh_hans: 还有 %lld 个未显示 — 搜索以查找。
zh_hant: 還有 %lld 個未顯示 — 搜尋以查找。

# %lld of %lld abilities on
source: %1$lld of %2$lld abilities on
zh_hans: %1$lld / %2$lld 项能力已开启
zh_hant: %1$lld / %2$lld 項能力已開啓

# %lld of %lld assigned
source: %1$lld of %2$lld assigned
zh_hans: %lld / %lld 已分配
zh_hant: %lld / %lld 已分配

source: %lld of %lld exposed
zh_hans: 已公开 %lld/%lld
zh_hant: 已公開 %lld/%lld

source: %lld of 1 ability on
zh_hans: %lld / 1 项能力已开启
zh_hant: %lld / 1 項能力已啟用

source: %lld of 1 fact
zh_hans: %lld / 1 条事实
zh_hant: %lld / 1 條事實

source: %lld of 1 theme
zh_hans: %lld / 1 个主题
zh_hant: %lld / 1 個主題

# %lld ok · %lld skipped · %lld err · %lld empty · %lld dead
source: %1$lld ok · %2$lld skipped · %3$lld err · %4$lld empty · %5$lld dead
zh_hans: %1$lld 正常 · %2$lld 跳过 · %3$lld 错误 · %4$lld 空 · %5$lld 失效
zh_hant: %1$lld 正常 · %2$lld 跳過 · %3$lld 錯誤 · %4$lld 空 · %5$lld 失效

# %lld pending · %lld processed · %lld dead · %lld all-time
source: %1$lld pending · %2$lld processed · %3$lld dead · %4$lld all-time
zh_hans: %1$lld 待处理 · %2$lld 已处理 · %3$lld 失效 · %4$lld 累计
zh_hant: %1$lld 待處理 · %2$lld 已處理 · %3$lld 失效 · %4$lld 累計

# %lld plugin%@ ha%@ an update available
source: %1$lld plugin%2$@ ha%3$@ an update available
zh_hans: %1$lld 个插件有可用更新
zh_hant: %1$lld 個插件有可用更新

source: %lld plugins need system permissions
zh_hans: %lld 个插件需要系统权限
zh_hant: %lld 個插件需要系統權限

# %lld provider%@ connected • %lld built-in source%@ as backup
source: %1$lld provider%2$@ connected • %3$lld built-in source%4$@ as backup
zh_hans: %1$lld 个提供商已连接 • %3$lld 个内置源作为备份
zh_hant: %1$lld 個提供者已連線 • %3$lld 個內置源作爲備份

# %lld provider%@ connected • %lld free source%@ as backup
source: %1$lld provider%2$@ connected • %3$lld free source%4$@ as backup
zh_hans: %1$lld 个提供商已连接 • %3$lld 个免费来源作为备选
zh_hant: %1$lld 個供應商已連線 • %3$lld 個免費來源作為備選

source: %lld recent
zh_hans: 最近 %lld 个
zh_hant: %lld 個最近

source: %lld redactions
zh_hans: %lld 处隐去
zh_hant: %lld 次編輯

source: %lld results
zh_hans: %lld 个结果
zh_hant: %lld 個結果

source: %lld sessions
zh_hans: %lld 个会话
zh_hant: %lld 個會話

source: %lld setup findings need attention before tools are fully ready.
zh_hans: 有 %lld 个设置发现需要关注，工具才能完全就绪。
zh_hant: 有 %lld 個設定發現需要關注，工具才能完全就緒。

source: %lld skipped (changed outside this chat).
zh_hans: %lld 个已跳过（在此聊天之外更改）。
zh_hant: %lld 個已跳過（在此聊天之外更改）。

source: %lld stdio providers
zh_hans: %lld 个 stdio 提供商
zh_hant: %lld 個 stdio 提供者

source: %lld stores couldn't be converted because the encryption key is unavailable.
zh_hans: %lld 个存储无法转换，因为加密密钥不可用。
zh_hant: %lld 個儲存無法轉換，因爲加密金鑰不可用。

source: %lld stores failed to convert.
zh_hans: %lld 个存储转换失败。
zh_hant: %lld 個儲存轉換失敗。

source: %lld tools assigned
zh_hans: 已分配 %lld 个工具
zh_hant: 已分配 %lld 個工具

# %lld tools assigned · %@
source: %1$lld tools assigned · %2$@
zh_hans: %lld 个工具已分配 · %@
zh_hant: %lld 個工具已分配 · %@

source: %lld tools discovered via %@.
zh_hans: 通过 %2$@ 发现了 %1$lld 个工具。
zh_hant: 透過 %2$@ 發現了 %1$lld 個工具。

source: %lld tools discovered.
zh_hans: 发现了 %lld 个工具。
zh_hant: 發現了 %lld 個工具。

source: %lld tools need permission
zh_hans: %lld 个工具需要权限
zh_hant: %lld 個工具需要權限

source: %lld transactions
zh_hans: %lld 笔交易
zh_hant: %lld 筌交易

# %lld/%lld connected - %lld attention - %@
source: %1$lld/%2$lld connected - %3$lld attention - %4$@
zh_hans: %lld/%lld 已连接 - %lld 个需注意 - %@
zh_hant: %lld/%lld 已連接 - %lld 注意力 - %@

# %lld/%lld connected, %lld attention, %@, %@
source: %1$lld/%2$lld connected, %3$lld attention, %4$@, %5$@
zh_hans: %lld/%lld 已连接，%lld 个需注意，%@，%@
zh_hant: %lld/%lld 已連接，%lld 注意力，%@，%@

source: %lld% used
zh_hans: 已使用 %lld%
zh_hant: 已使用 %lld%

source: %lld%% used
zh_hans: 已使用 %lld%%
zh_hant: 已使用 %lld%%

source: ↵ send · ⇧↵ new line · esc dismiss
zh_hans: ↵ 发送 · ⇧↵ 换行 · esc 取消
zh_hant: ↵ 傳送 · ⇧↵ 換行 · esc 取消

source: +%lld more
zh_hans: +另外 %lld 个
zh_hant: +%lld 更多

source: +1 more finding in copied report
zh_hans: 复制的报告中还有 1 个发现
zh_hant: 複製的報告中還有 1 個發現

source: 0 favors performance, 2 is Safe Auto, 3 is strict, and 4 removes automatic Osaurus caps.
zh_hans: 0 偏向性能，2 是安全自动，3 是严格，4 移除自动 Osaurus 限制。
zh_hant: 0 偏向效能，2 是安全自動，3 是嚴格，4 移除自動 Osaurus 限制。

source: 1 artifact
zh_hans: 1 个工件
zh_hant: 1 個工件

source: 1 blocking finding must be fixed before provisioning.
zh_hans: 必须先修复 1 个阻塞发现才能进行配置。
zh_hant: 必須先修復 1 個阻塞發現才能進行設定。

source: 1 character
zh_hans: 1 个字符
zh_hant: 1 個字元

source: 1 doc uncategorized
zh_hans: 1 个文档未分类
zh_hant: 1 個文件未分類

source: 1 document has no category
zh_hans: 1 个文档未设置分类
zh_hant: 1 個文件沒有類別

source: 1 document has no category. This is optional, agents can still search and read it. To let agents filter by category, add a `type:` line (e.g. `type: policy`) to the top of the file. Click for the list.
zh_hans: 有 1 篇文档未设置分类。此项为可选配置，智能体仍可搜索和读取该文档。若要让智能体按分类筛选，请在文件顶部添加 `type:` 字段（例如 `type: policy`）。点击查看文档列表。
zh_hant: 有 1 份文件未設定分類。此為可選設定，代理仍可搜尋和閱讀該檔案。若要讓代理按分類篩選，請在檔案頂部添加 `type:` 欄位（例如 `type: policy`）。點擊查看檔案列表。

source: 1 earlier step
zh_hans: 1 个更早的步骤
zh_hant: 1 個更早的步驟

source: 1 external candidate skipped
zh_hans: 跳过 1 个外部候选
zh_hant: 跳過 1 個外部候選

source: 1 external model found
zh_hans: 找到 1 个外部模型
zh_hant: 找到 1 個外部模型

source: 1 file
zh_hans: 1 个文件
zh_hant: 1 個檔案

source: 1 item installed
zh_hans: 已安装 1 个项目
zh_hant: 已安裝 1 個項目

source: 1 item would be redacted
zh_hans: 1 个项目将被脱敏
zh_hant: 1 個項目將被編輯

source: 1 manual-model provider
zh_hans: 1 个手动模型提供商
zh_hant: 1 個手動模型提供者

source: 1 model
zh_hans: 1 个模型
zh_hant: 1 個模型

source: 1 model • %@
zh_hans: 1 个模型 · %@
zh_hant: 1 個模型 · %@

source: 1 model currently available.
zh_hans: 当前可用 1 个模型。
zh_hant: 目前可用 1 個模型。

source: 1 model found
zh_hans: 找到 1 个模型
zh_hant: 找到 1 個模型

source: 1 plugin available
zh_hans: 1 个插件可用
zh_hant: 1 個插件可用

source: 1 plugin needs system permissions
zh_hans: 1 个插件需要系统权限
zh_hant: 1 個插件需要系統權限

source: 1 redaction
zh_hans: 1 次脱敏
zh_hant: 1 次編輯

source: 1 request
zh_hans: 1 个请求
zh_hant: 1 個請求

source: 1 result
zh_hans: 1 个结果
zh_hant: 1 個結果

source: 1 session
zh_hans: 1 个会话
zh_hant: 1 個會話

source: 1 setting matches "%@"
zh_hans: 1 个设置匹配 “%@”
zh_hant: 1 個設定匹配 "%@"

source: 1 setup finding needs attention before tools are fully ready.
zh_hans: 有 1 个设置发现需要关注，工具才能完全就绪。
zh_hant: 有 1 個設定發現需要關注，工具才能完全就絕。

source: 1 skill
zh_hans: 1 个技能
zh_hant: 1 個技能

source: 1 skill available
zh_hans: 1 个技能可用
zh_hant: 1 個技能可用

source: 1 stdio provider
zh_hans: 1 个 stdio 提供商
zh_hant: 1 個 stdio 提供者

source: 1 store couldn't be converted because the encryption key is unavailable.
zh_hans: 1 个存储无法转换，因为加密密钥不可用。
zh_hant: 1 個儲存無法轉換，因為加密金鑰不可用。

source: 1 store failed to convert.
zh_hans: 1 个存储转换失败。
zh_hant: 1 個儲存轉換失敗。

source: 1 tool
zh_hans: 1 个工具
zh_hant: 1 個工具

source: 1 tool assigned
zh_hans: 已分配 1 个工具
zh_hant: 已分配 1 個工具

source: 1 tool discovered via %@.
zh_hans: 通过 %@ 发现了 1 个工具。
zh_hant: 透過 %@ 發現了 1 個工具。

source: 1 tool discovered.
zh_hans: 发现了 1 个工具。
zh_hant: 發現了 1 個工具。

source: 1 tool needs permission
zh_hans: 1 个工具需要权限
zh_hant: 1 個工具需要權限

source: 1 tool sent
zh_hans: 已发送 1 个工具
zh_hant: 已發送 1 個工具

source: 1 transaction
zh_hans: 1 笔交易
zh_hant: 1 筌交易

source: 1 turn
zh_hans: 1 轮对话
zh_hant: 1 輪對話

source: 123456789 — one per line
zh_hans: 123456789 — 每行一个
zh_hant: 123456789 — 每行一個

source: 123456789012345678 — one per line
zh_hans: 123456789012345678 — 每行一个
zh_hant: 123456789012345678 — 每行一個

source: 987654321098765432 — one per line
zh_hans: 987654321098765432 — 每行一个
zh_hant: 987654321098765432 — 每行一個

source: A background job from this chat is still running — undo is paused until it finishes.
zh_hans: 此聊天的后台任务仍在运行 — 撤销已暂停，直到任务完成。
zh_hant: 此聊天的後臺任務仍在運行 — 復原已暫停，直到任務完成。

source: A bigger starting context means longer model warm-up and a slower first token.
zh_hans: 更大的起始上下文意味着更长的模型预热和更慢的首个 Token。
zh_hant: 更大的起始上下文意味著更長的模型預熵和更慢的首個 token。

source: A registered webhook blocks long polling with 409 conflicts. Removing the webhook keeps pending updates and hands receive back to long polling.
zh_hans: 已注册的 webhook 会以 409 冲突阻止长轮询。移除 webhook 可保留待处理更新并将接收交还给长轮询。
zh_hant: 已註冊的 webhook 會以 409 衝突阻止長輪詢。移除 webhook 可保留待處理更新並將接收交還給長輪詢。

source: A registered webhook blocks long polling; removing it hands receive back to long polling.
zh_hans: 已注册的 webhook 会阻止长轮询；移除它可将接收交还给长轮询。
zh_hant: 已註冊的 webhook 會阻止長輪詢；移除它可將接收交還給長輪詢。
